node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1096
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1096
          }
        }
        string_val: "input/training/n3/n3049.jpg"
        string_val: "input/training/n3/n3133.jpg"
        string_val: "input/training/n3/n3170.jpg"
        string_val: "input/training/n3/n3064.jpg"
        string_val: "input/training/n3/n3135.jpg"
        string_val: "input/training/n3/n3043.jpg"
        string_val: "input/training/n3/n3070.jpg"
        string_val: "input/training/n3/n3038.jpg"
        string_val: "input/training/n3/n3063.jpg"
        string_val: "input/training/n3/n3121.jpg"
        string_val: "input/training/n3/n3116.jpg"
        string_val: "input/training/n3/n3039.jpg"
        string_val: "input/training/n3/n3050.jpg"
        string_val: "input/training/n3/n3037.jpg"
        string_val: "input/training/n3/n3051.jpg"
        string_val: "input/training/n3/n3071.jpg"
        string_val: "input/training/n3/n3128.jpg"
        string_val: "input/training/n3/n3062.jpg"
        string_val: "input/training/n3/n3075.jpg"
        string_val: "input/training/n3/n3171.jpg"
        string_val: "input/training/n3/n3113.jpg"
        string_val: "input/training/n3/n3028.jpg"
        string_val: "input/training/n3/n3168.jpg"
        string_val: "input/training/n3/n3141.jpg"
        string_val: "input/training/n3/n3055.jpg"
        string_val: "input/training/n3/n3136.jpg"
        string_val: "input/training/n3/n3132.jpg"
        string_val: "input/training/n3/n3160.jpg"
        string_val: "input/training/n3/n3166.jpg"
        string_val: "input/training/n3/n3162.jpg"
        string_val: "input/training/n3/n3042.jpg"
        string_val: "input/training/n3/n3137.jpg"
        string_val: "input/training/n3/n3023.jpg"
        string_val: "input/training/n3/n3154.jpg"
        string_val: "input/training/n3/n3110.jpg"
        string_val: "input/training/n3/n3054.jpg"
        string_val: "input/training/n3/n3045.jpg"
        string_val: "input/training/n3/n3161.jpg"
        string_val: "input/training/n3/n3150.jpg"
        string_val: "input/training/n3/n3164.jpg"
        string_val: "input/training/n3/n3059.jpg"
        string_val: "input/training/n3/n3125.jpg"
        string_val: "input/training/n3/n3020.jpg"
        string_val: "input/training/n3/n3065.jpg"
        string_val: "input/training/n3/n3123.jpg"
        string_val: "input/training/n3/n3047.jpg"
        string_val: "input/training/n3/n3149.jpg"
        string_val: "input/training/n3/n3024.jpg"
        string_val: "input/training/n3/n3029.jpg"
        string_val: "input/training/n3/n3061.jpg"
        string_val: "input/training/n3/n3158.jpg"
        string_val: "input/training/n3/n3067.jpg"
        string_val: "input/training/n3/n3167.jpg"
        string_val: "input/training/n3/n3120.jpg"
        string_val: "input/training/n3/n3129.jpg"
        string_val: "input/training/n3/n3153.jpg"
        string_val: "input/training/n3/n3040.jpg"
        string_val: "input/training/n3/n3115.jpg"
        string_val: "input/training/n3/n3119.jpg"
        string_val: "input/training/n3/n3126.jpg"
        string_val: "input/training/n3/n3148.jpg"
        string_val: "input/training/n3/n3156.jpg"
        string_val: "input/training/n3/n3117.jpg"
        string_val: "input/training/n3/n3157.jpg"
        string_val: "input/training/n3/n3025.jpg"
        string_val: "input/training/n3/n3145.jpg"
        string_val: "input/training/n3/n3072.jpg"
        string_val: "input/training/n3/n3058.jpg"
        string_val: "input/training/n3/n3112.jpg"
        string_val: "input/training/n3/n3033.jpg"
        string_val: "input/training/n3/n3030.jpg"
        string_val: "input/training/n3/n3127.jpg"
        string_val: "input/training/n3/n3143.jpg"
        string_val: "input/training/n3/n3066.jpg"
        string_val: "input/training/n3/n3078.jpg"
        string_val: "input/training/n3/n3073.jpg"
        string_val: "input/training/n3/n3165.jpg"
        string_val: "input/training/n3/n3035.jpg"
        string_val: "input/training/n3/n3027.jpg"
        string_val: "input/training/n3/n3031.jpg"
        string_val: "input/training/n3/n3159.jpg"
        string_val: "input/training/n3/n3056.jpg"
        string_val: "input/training/n3/n3076.jpg"
        string_val: "input/training/n3/n3036.jpg"
        string_val: "input/training/n3/n3134.jpg"
        string_val: "input/training/n3/n3142.jpg"
        string_val: "input/training/n3/n3130.jpg"
        string_val: "input/training/n3/n3060.jpg"
        string_val: "input/training/n3/n3022.jpg"
        string_val: "input/training/n3/n3169.jpg"
        string_val: "input/training/n3/n3131.jpg"
        string_val: "input/training/n3/n3053.jpg"
        string_val: "input/training/n3/n3140.jpg"
        string_val: "input/training/n3/n3052.jpg"
        string_val: "input/training/n3/n3048.jpg"
        string_val: "input/training/n3/n3172.jpg"
        string_val: "input/training/n3/n3152.jpg"
        string_val: "input/training/n3/n3021.jpg"
        string_val: "input/training/n3/n3163.jpg"
        string_val: "input/training/n3/n3046.jpg"
        string_val: "input/training/n3/n3155.jpg"
        string_val: "input/training/n3/n3144.jpg"
        string_val: "input/training/n3/n3026.jpg"
        string_val: "input/training/n3/n3032.jpg"
        string_val: "input/training/n3/n3124.jpg"
        string_val: "input/training/n3/n3069.jpg"
        string_val: "input/training/n3/n3146.jpg"
        string_val: "input/training/n3/n3068.jpg"
        string_val: "input/training/n3/n3074.jpg"
        string_val: "input/training/n3/n3138.jpg"
        string_val: "input/training/n3/n3057.jpg"
        string_val: "input/training/n3/n3139.jpg"
        string_val: "input/training/n3/n3044.jpg"
        string_val: "input/training/n3/n3122.jpg"
        string_val: "input/training/n3/n3147.jpg"
        string_val: "input/training/n3/n3111.jpg"
        string_val: "input/training/n3/n3077.jpg"
        string_val: "input/training/n3/n3118.jpg"
        string_val: "input/training/n3/n3151.jpg"
        string_val: "input/training/n3/n3041.jpg"
        string_val: "input/training/n3/n3114.jpg"
        string_val: "input/training/n3/n3034.jpg"
        string_val: "input/training/n2/n2052.jpg"
        string_val: "input/training/n2/n2060.jpg"
        string_val: "input/training/n2/n2043.jpg"
        string_val: "input/training/n2/n2025.jpg"
        string_val: "input/training/n2/n2037.jpg"
        string_val: "input/training/n2/n2135.jpg"
        string_val: "input/training/n2/n2068.jpg"
        string_val: "input/training/n2/n2057.jpg"
        string_val: "input/training/n2/n2063.jpg"
        string_val: "input/training/n2/n2058.jpg"
        string_val: "input/training/n2/n2039.jpg"
        string_val: "input/training/n2/n2117.jpg"
        string_val: "input/training/n2/n2040.jpg"
        string_val: "input/training/n2/n2110.jpg"
        string_val: "input/training/n2/n2142.jpg"
        string_val: "input/training/n2/n2139.jpg"
        string_val: "input/training/n2/n2141.jpg"
        string_val: "input/training/n2/n2026.jpg"
        string_val: "input/training/n2/n2065.jpg"
        string_val: "input/training/n2/n2166.jpg"
        string_val: "input/training/n2/n2047.jpg"
        string_val: "input/training/n2/n2048.jpg"
        string_val: "input/training/n2/n2165.jpg"
        string_val: "input/training/n2/n2148.jpg"
        string_val: "input/training/n2/n2018.jpg"
        string_val: "input/training/n2/n2130.jpg"
        string_val: "input/training/n2/n2158.jpg"
        string_val: "input/training/n2/n2129.jpg"
        string_val: "input/training/n2/n2111.jpg"
        string_val: "input/training/n2/n2143.jpg"
        string_val: "input/training/n2/n2044.jpg"
        string_val: "input/training/n2/n2123.jpg"
        string_val: "input/training/n2/n2027.jpg"
        string_val: "input/training/n2/n2053.jpg"
        string_val: "input/training/n2/n2134.jpg"
        string_val: "input/training/n2/n2022.jpg"
        string_val: "input/training/n2/n2124.jpg"
        string_val: "input/training/n2/n2149.jpg"
        string_val: "input/training/n2/n2157.jpg"
        string_val: "input/training/n2/n2033.jpg"
        string_val: "input/training/n2/n2162.jpg"
        string_val: "input/training/n2/n2035.jpg"
        string_val: "input/training/n2/n2029.jpg"
        string_val: "input/training/n2/n2067.jpg"
        string_val: "input/training/n2/n2031.jpg"
        string_val: "input/training/n2/n2120.jpg"
        string_val: "input/training/n2/n2156.jpg"
        string_val: "input/training/n2/n2152.jpg"
        string_val: "input/training/n2/n2145.jpg"
        string_val: "input/training/n2/n2132.jpg"
        string_val: "input/training/n2/n2137.jpg"
        string_val: "input/training/n2/n2116.jpg"
        string_val: "input/training/n2/n2155.jpg"
        string_val: "input/training/n2/n2122.jpg"
        string_val: "input/training/n2/n2147.jpg"
        string_val: "input/training/n2/n2131.jpg"
        string_val: "input/training/n2/n2160.jpg"
        string_val: "input/training/n2/n2064.jpg"
        string_val: "input/training/n2/n2125.jpg"
        string_val: "input/training/n2/n2030.jpg"
        string_val: "input/training/n2/n2061.jpg"
        string_val: "input/training/n2/n2114.jpg"
        string_val: "input/training/n2/n2028.jpg"
        string_val: "input/training/n2/n2045.jpg"
        string_val: "input/training/n2/n2066.jpg"
        string_val: "input/training/n2/n2163.jpg"
        string_val: "input/training/n2/n2042.jpg"
        string_val: "input/training/n2/n2127.jpg"
        string_val: "input/training/n2/n2153.jpg"
        string_val: "input/training/n2/n2046.jpg"
        string_val: "input/training/n2/n2136.jpg"
        string_val: "input/training/n2/n2032.jpg"
        string_val: "input/training/n2/n2121.jpg"
        string_val: "input/training/n2/n2069.jpg"
        string_val: "input/training/n2/n2050.jpg"
        string_val: "input/training/n2/n2118.jpg"
        string_val: "input/training/n2/n2140.jpg"
        string_val: "input/training/n2/n2138.jpg"
        string_val: "input/training/n2/n2036.jpg"
        string_val: "input/training/n2/n2038.jpg"
        string_val: "input/training/n2/n2020.jpg"
        string_val: "input/training/n2/n2150.jpg"
        string_val: "input/training/n2/n2019.jpg"
        string_val: "input/training/n2/n2049.jpg"
        string_val: "input/training/n2/n2146.jpg"
        string_val: "input/training/n2/n2112.jpg"
        string_val: "input/training/n2/n2159.jpg"
        string_val: "input/training/n2/n2133.jpg"
        string_val: "input/training/n2/n2051.jpg"
        string_val: "input/training/n2/n2161.jpg"
        string_val: "input/training/n2/n2164.jpg"
        string_val: "input/training/n2/n2115.jpg"
        string_val: "input/training/n2/n2144.jpg"
        string_val: "input/training/n2/n2041.jpg"
        string_val: "input/training/n2/n2017.jpg"
        string_val: "input/training/n2/n2056.jpg"
        string_val: "input/training/n2/n2119.jpg"
        string_val: "input/training/n2/n2021.jpg"
        string_val: "input/training/n2/n2062.jpg"
        string_val: "input/training/n2/n2023.jpg"
        string_val: "input/training/n2/n2024.jpg"
        string_val: "input/training/n2/n2154.jpg"
        string_val: "input/training/n2/n2034.jpg"
        string_val: "input/training/n2/n2128.jpg"
        string_val: "input/training/n2/n2126.jpg"
        string_val: "input/training/n2/n2054.jpg"
        string_val: "input/training/n2/n2151.jpg"
        string_val: "input/training/n2/n2055.jpg"
        string_val: "input/training/n2/n2059.jpg"
        string_val: "input/training/n2/n2113.jpg"
        string_val: "input/training/n6/n6024.jpg"
        string_val: "input/training/n6/n6144.jpg"
        string_val: "input/training/n6/n6057.jpg"
        string_val: "input/training/n6/n6121.jpg"
        string_val: "input/training/n6/n6152.jpg"
        string_val: "input/training/n6/n6125.jpg"
        string_val: "input/training/n6/n6128.jpg"
        string_val: "input/training/n6/n6049.jpg"
        string_val: "input/training/n6/n6046.jpg"
        string_val: "input/training/n6/n6037.jpg"
        string_val: "input/training/n6/n6147.jpg"
        string_val: "input/training/n6/n6031.jpg"
        string_val: "input/training/n6/n6067.jpg"
        string_val: "input/training/n6/n6118.jpg"
        string_val: "input/training/n6/n6055.jpg"
        string_val: "input/training/n6/n6020.jpg"
        string_val: "input/training/n6/n6142.jpg"
        string_val: "input/training/n6/n6032.jpg"
        string_val: "input/training/n6/n6040.jpg"
        string_val: "input/training/n6/n6110.jpg"
        string_val: "input/training/n6/n6132.jpg"
        string_val: "input/training/n6/n6154.jpg"
        string_val: "input/training/n6/n6126.jpg"
        string_val: "input/training/n6/n6045.jpg"
        string_val: "input/training/n6/n6129.jpg"
        string_val: "input/training/n6/n6161.jpg"
        string_val: "input/training/n6/n6058.jpg"
        string_val: "input/training/n6/n6146.jpg"
        string_val: "input/training/n6/n6145.jpg"
        string_val: "input/training/n6/n6056.jpg"
        string_val: "input/training/n6/n6068.jpg"
        string_val: "input/training/n6/n6112.jpg"
        string_val: "input/training/n6/n6016.jpg"
        string_val: "input/training/n6/n6059.jpg"
        string_val: "input/training/n6/n6053.jpg"
        string_val: "input/training/n6/n6029.jpg"
        string_val: "input/training/n6/n6041.jpg"
        string_val: "input/training/n6/n6120.jpg"
        string_val: "input/training/n6/n6026.jpg"
        string_val: "input/training/n6/n6141.jpg"
        string_val: "input/training/n6/n6149.jpg"
        string_val: "input/training/n6/n6116.jpg"
        string_val: "input/training/n6/n6135.jpg"
        string_val: "input/training/n6/n6156.jpg"
        string_val: "input/training/n6/n6131.jpg"
        string_val: "input/training/n6/n6023.jpg"
        string_val: "input/training/n6/n6153.jpg"
        string_val: "input/training/n6/n6050.jpg"
        string_val: "input/training/n6/n6048.jpg"
        string_val: "input/training/n6/n6043.jpg"
        string_val: "input/training/n6/n6122.jpg"
        string_val: "input/training/n6/n6047.jpg"
        string_val: "input/training/n6/n6027.jpg"
        string_val: "input/training/n6/n6042.jpg"
        string_val: "input/training/n6/n6019.jpg"
        string_val: "input/training/n6/n6034.jpg"
        string_val: "input/training/n6/n6030.jpg"
        string_val: "input/training/n6/n6151.jpg"
        string_val: "input/training/n6/n6158.jpg"
        string_val: "input/training/n6/n6022.jpg"
        string_val: "input/training/n6/n6140.jpg"
        string_val: "input/training/n6/n6119.jpg"
        string_val: "input/training/n6/n6052.jpg"
        string_val: "input/training/n6/n6143.jpg"
        string_val: "input/training/n6/n6044.jpg"
        string_val: "input/training/n6/n6065.jpg"
        string_val: "input/training/n6/n6069.jpg"
        string_val: "input/training/n6/n6139.jpg"
        string_val: "input/training/n6/n6062.jpg"
        string_val: "input/training/n6/n6038.jpg"
        string_val: "input/training/n6/n6111.jpg"
        string_val: "input/training/n6/n6130.jpg"
        string_val: "input/training/n6/n6114.jpg"
        string_val: "input/training/n6/n6054.jpg"
        string_val: "input/training/n6/n6150.jpg"
        string_val: "input/training/n6/n6124.jpg"
        string_val: "input/training/n6/n6148.jpg"
        string_val: "input/training/n6/n6051.jpg"
        string_val: "input/training/n6/n6066.jpg"
        string_val: "input/training/n6/n6157.jpg"
        string_val: "input/training/n6/n6115.jpg"
        string_val: "input/training/n6/n6017.jpg"
        string_val: "input/training/n6/n6035.jpg"
        string_val: "input/training/n6/n6064.jpg"
        string_val: "input/training/n6/n6036.jpg"
        string_val: "input/training/n6/n6134.jpg"
        string_val: "input/training/n6/n6113.jpg"
        string_val: "input/training/n6/n6018.jpg"
        string_val: "input/training/n6/n6160.jpg"
        string_val: "input/training/n6/n6063.jpg"
        string_val: "input/training/n6/n6028.jpg"
        string_val: "input/training/n6/n6123.jpg"
        string_val: "input/training/n6/n6025.jpg"
        string_val: "input/training/n6/n6155.jpg"
        string_val: "input/training/n6/n6137.jpg"
        string_val: "input/training/n6/n6033.jpg"
        string_val: "input/training/n6/n6039.jpg"
        string_val: "input/training/n6/n6133.jpg"
        string_val: "input/training/n6/n6060.jpg"
        string_val: "input/training/n6/n6117.jpg"
        string_val: "input/training/n6/n6021.jpg"
        string_val: "input/training/n6/n6138.jpg"
        string_val: "input/training/n6/n6061.jpg"
        string_val: "input/training/n6/n6136.jpg"
        string_val: "input/training/n6/n6127.jpg"
        string_val: "input/training/n6/n6159.jpg"
        string_val: "input/training/n8/n8069.jpg"
        string_val: "input/training/n8/n8057.jpg"
        string_val: "input/training/n8/n8132.jpg"
        string_val: "input/training/n8/n8047.jpg"
        string_val: "input/training/n8/n8133.jpg"
        string_val: "input/training/n8/n8130.jpg"
        string_val: "input/training/n8/n8141.jpg"
        string_val: "input/training/n8/n8062.jpg"
        string_val: "input/training/n8/n8139.jpg"
        string_val: "input/training/n8/n8128.jpg"
        string_val: "input/training/n8/n8148.jpg"
        string_val: "input/training/n8/n8075.jpg"
        string_val: "input/training/n8/n8113.jpg"
        string_val: "input/training/n8/n8034.jpg"
        string_val: "input/training/n8/n8123.jpg"
        string_val: "input/training/n8/n8032.jpg"
        string_val: "input/training/n8/n8140.jpg"
        string_val: "input/training/n8/n8150.jpg"
        string_val: "input/training/n8/n8043.jpg"
        string_val: "input/training/n8/n8022.jpg"
        string_val: "input/training/n8/n8111.jpg"
        string_val: "input/training/n8/n8151.jpg"
        string_val: "input/training/n8/n8053.jpg"
        string_val: "input/training/n8/n8116.jpg"
        string_val: "input/training/n8/n8134.jpg"
        string_val: "input/training/n8/n8117.jpg"
        string_val: "input/training/n8/n8146.jpg"
        string_val: "input/training/n8/n8145.jpg"
        string_val: "input/training/n8/n8147.jpg"
        string_val: "input/training/n8/n8041.jpg"
        string_val: "input/training/n8/n8029.jpg"
        string_val: "input/training/n8/n8044.jpg"
        string_val: "input/training/n8/n8142.jpg"
        string_val: "input/training/n8/n8077.jpg"
        string_val: "input/training/n8/n8050.jpg"
        string_val: "input/training/n8/n8129.jpg"
        string_val: "input/training/n8/n8125.jpg"
        string_val: "input/training/n8/n8110.jpg"
        string_val: "input/training/n8/n8136.jpg"
        string_val: "input/training/n8/n8135.jpg"
        string_val: "input/training/n8/n8058.jpg"
        string_val: "input/training/n8/n8076.jpg"
        string_val: "input/training/n8/n8054.jpg"
        string_val: "input/training/n8/n8144.jpg"
        string_val: "input/training/n8/n8019.jpg"
        string_val: "input/training/n8/n8079.jpg"
        string_val: "input/training/n8/n8127.jpg"
        string_val: "input/training/n8/n8131.jpg"
        string_val: "input/training/n8/n8056.jpg"
        string_val: "input/training/n8/n8033.jpg"
        string_val: "input/training/n8/n8046.jpg"
        string_val: "input/training/n8/n8038.jpg"
        string_val: "input/training/n8/n8045.jpg"
        string_val: "input/training/n8/n8055.jpg"
        string_val: "input/training/n8/n8051.jpg"
        string_val: "input/training/n8/n8066.jpg"
        string_val: "input/training/n8/n8042.jpg"
        string_val: "input/training/n8/n8114.jpg"
        string_val: "input/training/n8/n8025.jpg"
        string_val: "input/training/n8/n8030.jpg"
        string_val: "input/training/n8/n8118.jpg"
        string_val: "input/training/n8/n8049.jpg"
        string_val: "input/training/n8/n8122.jpg"
        string_val: "input/training/n8/n8064.jpg"
        string_val: "input/training/n8/n8112.jpg"
        string_val: "input/training/n8/n8039.jpg"
        string_val: "input/training/n8/n8035.jpg"
        string_val: "input/training/n8/n8074.jpg"
        string_val: "input/training/n8/n8028.jpg"
        string_val: "input/training/n8/n8059.jpg"
        string_val: "input/training/n8/n8121.jpg"
        string_val: "input/training/n8/n8063.jpg"
        string_val: "input/training/n8/n8052.jpg"
        string_val: "input/training/n8/n8060.jpg"
        string_val: "input/training/n8/n8027.jpg"
        string_val: "input/training/n8/n818.jpg"
        string_val: "input/training/n8/n8143.jpg"
        string_val: "input/training/n8/n8067.jpg"
        string_val: "input/training/n8/n8126.jpg"
        string_val: "input/training/n8/n8068.jpg"
        string_val: "input/training/n8/n8120.jpg"
        string_val: "input/training/n8/n8018.jpg"
        string_val: "input/training/n8/n8137.jpg"
        string_val: "input/training/n8/n8065.jpg"
        string_val: "input/training/n8/n8080.jpg"
        string_val: "input/training/n8/n8040.jpg"
        string_val: "input/training/n8/n8149.jpg"
        string_val: "input/training/n8/n8073.jpg"
        string_val: "input/training/n8/n8061.jpg"
        string_val: "input/training/n8/n8036.jpg"
        string_val: "input/training/n8/n808.jpg"
        string_val: "input/training/n8/n8115.jpg"
        string_val: "input/training/n8/n8071.jpg"
        string_val: "input/training/n8/n8072.jpg"
        string_val: "input/training/n8/n8024.jpg"
        string_val: "input/training/n8/n8078.jpg"
        string_val: "input/training/n8/n817.jpg"
        string_val: "input/training/n8/n8023.jpg"
        string_val: "input/training/n8/n8037.jpg"
        string_val: "input/training/n8/n8124.jpg"
        string_val: "input/training/n8/n8070.jpg"
        string_val: "input/training/n8/n8138.jpg"
        string_val: "input/training/n8/n8048.jpg"
        string_val: "input/training/n8/n8026.jpg"
        string_val: "input/training/n8/n8020.jpg"
        string_val: "input/training/n8/n8119.jpg"
        string_val: "input/training/n4/n4025.jpg"
        string_val: "input/training/n4/n4051.jpg"
        string_val: "input/training/n4/n4027.jpg"
        string_val: "input/training/n4/n4034.jpg"
        string_val: "input/training/n4/n4149.jpg"
        string_val: "input/training/n4/n4139.jpg"
        string_val: "input/training/n4/n4061.jpg"
        string_val: "input/training/n4/n4147.jpg"
        string_val: "input/training/n4/n4151.jpg"
        string_val: "input/training/n4/n4131.jpg"
        string_val: "input/training/n4/n4058.jpg"
        string_val: "input/training/n4/n4043.jpg"
        string_val: "input/training/n4/n4120.jpg"
        string_val: "input/training/n4/n41556.jpg"
        string_val: "input/training/n4/n4126.jpg"
        string_val: "input/training/n4/n4045.jpg"
        string_val: "input/training/n4/n41562.jpg"
        string_val: "input/training/n4/n4122.jpg"
        string_val: "input/training/n4/n4030.jpg"
        string_val: "input/training/n4/n4017.jpg"
        string_val: "input/training/n4/n4062.jpg"
        string_val: "input/training/n4/n4138.jpg"
        string_val: "input/training/n4/n4064.jpg"
        string_val: "input/training/n4/n4116.jpg"
        string_val: "input/training/n4/n4153.jpg"
        string_val: "input/training/n4/n41557.jpg"
        string_val: "input/training/n4/n4144.jpg"
        string_val: "input/training/n4/n4038.jpg"
        string_val: "input/training/n4/n4019.jpg"
        string_val: "input/training/n4/n4127.jpg"
        string_val: "input/training/n4/n41563.jpg"
        string_val: "input/training/n4/n4150.jpg"
        string_val: "input/training/n4/n41561.jpg"
        string_val: "input/training/n4/n4115.jpg"
        string_val: "input/training/n4/n4128.jpg"
        string_val: "input/training/n4/n4154.jpg"
        string_val: "input/training/n4/n4141.jpg"
        string_val: "input/training/n4/n4111.jpg"
        string_val: "input/training/n4/n4121.jpg"
        string_val: "input/training/n4/n4129.jpg"
        string_val: "input/training/n4/n4022.jpg"
        string_val: "input/training/n4/n4031.jpg"
        string_val: "input/training/n4/n4048.jpg"
        string_val: "input/training/n4/n4033.jpg"
        string_val: "input/training/n4/n4018.jpg"
        string_val: "input/training/n4/n4142.jpg"
        string_val: "input/training/n4/n4135.jpg"
        string_val: "input/training/n4/n4028.jpg"
        string_val: "input/training/n4/n4052.jpg"
        string_val: "input/training/n4/n4049.jpg"
        string_val: "input/training/n4/n4130.jpg"
        string_val: "input/training/n4/n4155.jpg"
        string_val: "input/training/n4/n4114.jpg"
        string_val: "input/training/n4/n4056.jpg"
        string_val: "input/training/n4/n4146.jpg"
        string_val: "input/training/n4/n4125.jpg"
        string_val: "input/training/n4/n4016.jpg"
        string_val: "input/training/n4/n4060.jpg"
        string_val: "input/training/n4/n4050.jpg"
        string_val: "input/training/n4/n4137.jpg"
        string_val: "input/training/n4/n4042.jpg"
        string_val: "input/training/n4/n4037.jpg"
        string_val: "input/training/n4/n4117.jpg"
        string_val: "input/training/n4/n41564.jpg"
        string_val: "input/training/n4/n4132.jpg"
        string_val: "input/training/n4/n4133.jpg"
        string_val: "input/training/n4/n4054.jpg"
        string_val: "input/training/n4/n4118.jpg"
        string_val: "input/training/n4/n4119.jpg"
        string_val: "input/training/n4/n4110.jpg"
        string_val: "input/training/n4/n4035.jpg"
        string_val: "input/training/n4/n4039.jpg"
        string_val: "input/training/n4/n4136.jpg"
        string_val: "input/training/n4/n4124.jpg"
        string_val: "input/training/n4/n4123.jpg"
        string_val: "input/training/n4/n4029.jpg"
        string_val: "input/training/n4/n4055.jpg"
        string_val: "input/training/n4/n4059.jpg"
        string_val: "input/training/n4/n4036.jpg"
        string_val: "input/training/n4/n4152.jpg"
        string_val: "input/training/n4/n4057.jpg"
        string_val: "input/training/n4/n4143.jpg"
        string_val: "input/training/n4/n4041.jpg"
        string_val: "input/training/n4/n4040.jpg"
        string_val: "input/training/n4/n41559.jpg"
        string_val: "input/training/n4/n4148.jpg"
        string_val: "input/training/n4/n4026.jpg"
        string_val: "input/training/n4/n4023.jpg"
        string_val: "input/training/n4/n4032.jpg"
        string_val: "input/training/n4/n4063.jpg"
        string_val: "input/training/n4/n4140.jpg"
        string_val: "input/training/n4/n4047.jpg"
        string_val: "input/training/n4/n4024.jpg"
        string_val: "input/training/n4/n4044.jpg"
        string_val: "input/training/n4/n4046.jpg"
        string_val: "input/training/n4/n4134.jpg"
        string_val: "input/training/n4/n4053.jpg"
        string_val: "input/training/n4/n4021.jpg"
        string_val: "input/training/n4/n4112.jpg"
        string_val: "input/training/n4/n4113.jpg"
        string_val: "input/training/n4/n4145.jpg"
        string_val: "input/training/n4/n41560.jpg"
        string_val: "input/training/n4/n41558.jpg"
        string_val: "input/training/n4/n4020.jpg"
        string_val: "input/training/n4/n41565.jpg"
        string_val: "input/training/n1/n1153.jpg"
        string_val: "input/training/n1/n1152.jpg"
        string_val: "input/training/n1/n1063.jpg"
        string_val: "input/training/n1/n1049.jpg"
        string_val: "input/training/n1/n1138.jpg"
        string_val: "input/training/n1/n1034.jpg"
        string_val: "input/training/n1/n1043.jpg"
        string_val: "input/training/n1/n1021.jpg"
        string_val: "input/training/n1/n1059.jpg"
        string_val: "input/training/n1/n1070.jpg"
        string_val: "input/training/n1/n1124.jpg"
        string_val: "input/training/n1/n1157.jpg"
        string_val: "input/training/n1/n1147.jpg"
        string_val: "input/training/n1/n1035.jpg"
        string_val: "input/training/n1/n1045.jpg"
        string_val: "input/training/n1/n1115.jpg"
        string_val: "input/training/n1/n1111.jpg"
        string_val: "input/training/n1/n1130.jpg"
        string_val: "input/training/n1/n1141.jpg"
        string_val: "input/training/n1/n1048.jpg"
        string_val: "input/training/n1/n1037.jpg"
        string_val: "input/training/n1/n1072.jpg"
        string_val: "input/training/n1/n1136.jpg"
        string_val: "input/training/n1/n1041.jpg"
        string_val: "input/training/n1/n1110.jpg"
        string_val: "input/training/n1/n1030.jpg"
        string_val: "input/training/n1/n1143.jpg"
        string_val: "input/training/n1/n1050.jpg"
        string_val: "input/training/n1/n1142.jpg"
        string_val: "input/training/n1/n1054.jpg"
        string_val: "input/training/n1/n1019.jpg"
        string_val: "input/training/n1/n1062.jpg"
        string_val: "input/training/n1/n1164.jpg"
        string_val: "input/training/n1/n1133.jpg"
        string_val: "input/training/n1/n1165.jpg"
        string_val: "input/training/n1/n1023.jpg"
        string_val: "input/training/n1/n1118.jpg"
        string_val: "input/training/n1/n1038.jpg"
        string_val: "input/training/n1/n1025.jpg"
        string_val: "input/training/n1/n1071.jpg"
        string_val: "input/training/n1/n1022.jpg"
        string_val: "input/training/n1/n1061.jpg"
        string_val: "input/training/n1/n1044.jpg"
        string_val: "input/training/n1/n1060.jpg"
        string_val: "input/training/n1/n1162.jpg"
        string_val: "input/training/n1/n1114.jpg"
        string_val: "input/training/n1/n1127.jpg"
        string_val: "input/training/n1/n1024.jpg"
        string_val: "input/training/n1/n1125.jpg"
        string_val: "input/training/n1/n1113.jpg"
        string_val: "input/training/n1/n1067.jpg"
        string_val: "input/training/n1/n1161.jpg"
        string_val: "input/training/n1/n1131.jpg"
        string_val: "input/training/n1/n1066.jpg"
        string_val: "input/training/n1/n1051.jpg"
        string_val: "input/training/n1/n1028.jpg"
        string_val: "input/training/n1/n1047.jpg"
        string_val: "input/training/n1/n1154.jpg"
        string_val: "input/training/n1/n1058.jpg"
        string_val: "input/training/n1/n1148.jpg"
        string_val: "input/training/n1/n1129.jpg"
        string_val: "input/training/n1/n1064.jpg"
        string_val: "input/training/n1/n1119.jpg"
        string_val: "input/training/n1/n1052.jpg"
        string_val: "input/training/n1/n1042.jpg"
        string_val: "input/training/n1/n1069.jpg"
        string_val: "input/training/n1/n1026.jpg"
        string_val: "input/training/n1/n1155.jpg"
        string_val: "input/training/n1/n1120.jpg"
        string_val: "input/training/n1/n1116.jpg"
        string_val: "input/training/n1/n1126.jpg"
        string_val: "input/training/n1/n1121.jpg"
        string_val: "input/training/n1/n1036.jpg"
        string_val: "input/training/n1/n1039.jpg"
        string_val: "input/training/n1/n1134.jpg"
        string_val: "input/training/n1/n1046.jpg"
        string_val: "input/training/n1/n1122.jpg"
        string_val: "input/training/n1/n1158.jpg"
        string_val: "input/training/n1/n1139.jpg"
        string_val: "input/training/n1/n1146.jpg"
        string_val: "input/training/n1/n1065.jpg"
        string_val: "input/training/n1/n1159.jpg"
        string_val: "input/training/n1/n1160.jpg"
        string_val: "input/training/n1/n1027.jpg"
        string_val: "input/training/n1/n1033.jpg"
        string_val: "input/training/n1/n1032.jpg"
        string_val: "input/training/n1/n1017.jpg"
        string_val: "input/training/n1/n1117.jpg"
        string_val: "input/training/n1/n1144.jpg"
        string_val: "input/training/n1/n1018.jpg"
        string_val: "input/training/n1/n1068.jpg"
        string_val: "input/training/n1/n1132.jpg"
        string_val: "input/training/n1/n1055.jpg"
        string_val: "input/training/n1/n1029.jpg"
        string_val: "input/training/n1/n1140.jpg"
        string_val: "input/training/n1/n1053.jpg"
        string_val: "input/training/n1/n1112.jpg"
        string_val: "input/training/n1/n1056.jpg"
        string_val: "input/training/n1/n1150.jpg"
        string_val: "input/training/n1/n1145.jpg"
        string_val: "input/training/n1/n1135.jpg"
        string_val: "input/training/n1/n1137.jpg"
        string_val: "input/training/n1/n1123.jpg"
        string_val: "input/training/n1/n1040.jpg"
        string_val: "input/training/n1/n1057.jpg"
        string_val: "input/training/n1/n1156.jpg"
        string_val: "input/training/n1/n1149.jpg"
        string_val: "input/training/n1/n1163.jpg"
        string_val: "input/training/n1/n1031.jpg"
        string_val: "input/training/n1/n1128.jpg"
        string_val: "input/training/n1/n1151.jpg"
        string_val: "input/training/n5/n5143.jpg"
        string_val: "input/training/n5/n5114.jpg"
        string_val: "input/training/n5/n5122.jpg"
        string_val: "input/training/n5/n5149.jpg"
        string_val: "input/training/n5/n5037.jpg"
        string_val: "input/training/n5/n5071.jpg"
        string_val: "input/training/n5/n5045.jpg"
        string_val: "input/training/n5/n5023.jpg"
        string_val: "input/training/n5/n5059.jpg"
        string_val: "input/training/n5/n5052.jpg"
        string_val: "input/training/n5/n5145.jpg"
        string_val: "input/training/n5/n5061.jpg"
        string_val: "input/training/n5/n5068.jpg"
        string_val: "input/training/n5/n5139.jpg"
        string_val: "input/training/n5/n5128.jpg"
        string_val: "input/training/n5/n5055.jpg"
        string_val: "input/training/n5/n5130.jpg"
        string_val: "input/training/n5/n5064.jpg"
        string_val: "input/training/n5/n5131.jpg"
        string_val: "input/training/n5/n5031.jpg"
        string_val: "input/training/n5/n5033.jpg"
        string_val: "input/training/n5/n5165.jpg"
        string_val: "input/training/n5/n5157.jpg"
        string_val: "input/training/n5/n5026.jpg"
        string_val: "input/training/n5/n5034.jpg"
        string_val: "input/training/n5/n5121.jpg"
        string_val: "input/training/n5/n5133.jpg"
        string_val: "input/training/n5/n5118.jpg"
        string_val: "input/training/n5/n5058.jpg"
        string_val: "input/training/n5/n5158.jpg"
        string_val: "input/training/n5/n5054.jpg"
        string_val: "input/training/n5/n5117.jpg"
        string_val: "input/training/n5/n5162.jpg"
        string_val: "input/training/n5/n5038.jpg"
        string_val: "input/training/n5/n5112.jpg"
        string_val: "input/training/n5/n5125.jpg"
        string_val: "input/training/n5/n5156.jpg"
        string_val: "input/training/n5/n5126.jpg"
        string_val: "input/training/n5/n5141.jpg"
        string_val: "input/training/n5/n5060.jpg"
        string_val: "input/training/n5/n5028.jpg"
        string_val: "input/training/n5/n5135.jpg"
        string_val: "input/training/n5/n5154.jpg"
        string_val: "input/training/n5/n5043.jpg"
        string_val: "input/training/n5/n5163.jpg"
        string_val: "input/training/n5/n5160.jpg"
        string_val: "input/training/n5/n5116.jpg"
        string_val: "input/training/n5/n5032.jpg"
        string_val: "input/training/n5/n5161.jpg"
        string_val: "input/training/n5/n5115.jpg"
        string_val: "input/training/n5/n5020.jpg"
        string_val: "input/training/n5/n5140.jpg"
        string_val: "input/training/n5/n5144.jpg"
        string_val: "input/training/n5/n5019.jpg"
        string_val: "input/training/n5/n5022.jpg"
        string_val: "input/training/n5/n5111.jpg"
        string_val: "input/training/n5/n5069.jpg"
        string_val: "input/training/n5/n5036.jpg"
        string_val: "input/training/n5/n5066.jpg"
        string_val: "input/training/n5/n5138.jpg"
        string_val: "input/training/n5/n5062.jpg"
        string_val: "input/training/n5/n5113.jpg"
        string_val: "input/training/n5/n5067.jpg"
        string_val: "input/training/n5/n5152.jpg"
        string_val: "input/training/n5/n5030.jpg"
        string_val: "input/training/n5/n5127.jpg"
        string_val: "input/training/n5/n5159.jpg"
        string_val: "input/training/n5/n5070.jpg"
        string_val: "input/training/n5/n5057.jpg"
        string_val: "input/training/n5/n5110.jpg"
        string_val: "input/training/n5/n5146.jpg"
        string_val: "input/training/n5/n5047.jpg"
        string_val: "input/training/n5/n5048.jpg"
        string_val: "input/training/n5/n5136.jpg"
        string_val: "input/training/n5/n5063.jpg"
        string_val: "input/training/n5/n5134.jpg"
        string_val: "input/training/n5/n5151.jpg"
        string_val: "input/training/n5/n5056.jpg"
        string_val: "input/training/n5/n5072.jpg"
        string_val: "input/training/n5/n5053.jpg"
        string_val: "input/training/n5/n5042.jpg"
        string_val: "input/training/n5/n5142.jpg"
        string_val: "input/training/n5/n5044.jpg"
        string_val: "input/training/n5/n5123.jpg"
        string_val: "input/training/n5/n5155.jpg"
        string_val: "input/training/n5/n5147.jpg"
        string_val: "input/training/n5/n5035.jpg"
        string_val: "input/training/n5/n5120.jpg"
        string_val: "input/training/n5/n5039.jpg"
        string_val: "input/training/n5/n5024.jpg"
        string_val: "input/training/n5/n5027.jpg"
        string_val: "input/training/n5/n5153.jpg"
        string_val: "input/training/n5/n5029.jpg"
        string_val: "input/training/n5/n5018.jpg"
        string_val: "input/training/n5/n5051.jpg"
        string_val: "input/training/n5/n5065.jpg"
        string_val: "input/training/n5/n5021.jpg"
        string_val: "input/training/n5/n5137.jpg"
        string_val: "input/training/n5/n5050.jpg"
        string_val: "input/training/n5/n5166.jpg"
        string_val: "input/training/n5/n5073.jpg"
        string_val: "input/training/n5/n5148.jpg"
        string_val: "input/training/n5/n5025.jpg"
        string_val: "input/training/n5/n5119.jpg"
        string_val: "input/training/n5/n5164.jpg"
        string_val: "input/training/n5/n5040.jpg"
        string_val: "input/training/n5/n5129.jpg"
        string_val: "input/training/n5/n5046.jpg"
        string_val: "input/training/n5/n5132.jpg"
        string_val: "input/training/n5/n5124.jpg"
        string_val: "input/training/n5/n5041.jpg"
        string_val: "input/training/n5/n5150.jpg"
        string_val: "input/training/n5/n5049.jpg"
        string_val: "input/training/n7/n7156.jpg"
        string_val: "input/training/n7/n7026.jpg"
        string_val: "input/training/n7/n7142.jpg"
        string_val: "input/training/n7/n7022.jpg"
        string_val: "input/training/n7/n7140.jpg"
        string_val: "input/training/n7/n7030.jpg"
        string_val: "input/training/n7/n7045.jpg"
        string_val: "input/training/n7/n7065.jpg"
        string_val: "input/training/n7/n7123.jpg"
        string_val: "input/training/n7/n7036.jpg"
        string_val: "input/training/n7/n7144.jpg"
        string_val: "input/training/n7/n7117.jpg"
        string_val: "input/training/n7/n7039.jpg"
        string_val: "input/training/n7/n7029.jpg"
        string_val: "input/training/n7/n7152.jpg"
        string_val: "input/training/n7/n7157.jpg"
        string_val: "input/training/n7/n7134.jpg"
        string_val: "input/training/n7/n7164.jpg"
        string_val: "input/training/n7/n7041.jpg"
        string_val: "input/training/n7/n7116.jpg"
        string_val: "input/training/n7/n7027.jpg"
        string_val: "input/training/n7/n7147.jpg"
        string_val: "input/training/n7/n7115.jpg"
        string_val: "input/training/n7/n7067.jpg"
        string_val: "input/training/n7/n7025.jpg"
        string_val: "input/training/n7/n7126.jpg"
        string_val: "input/training/n7/n7118.jpg"
        string_val: "input/training/n7/n7040.jpg"
        string_val: "input/training/n7/n7071.jpg"
        string_val: "input/training/n7/n7135.jpg"
        string_val: "input/training/n7/n7063.jpg"
        string_val: "input/training/n7/n7058.jpg"
        string_val: "input/training/n7/n7021.jpg"
        string_val: "input/training/n7/n7054.jpg"
        string_val: "input/training/n7/n7168.jpg"
        string_val: "input/training/n7/n7119.jpg"
        string_val: "input/training/n7/n7052.jpg"
        string_val: "input/training/n7/n7130.jpg"
        string_val: "input/training/n7/n7136.jpg"
        string_val: "input/training/n7/n7120.jpg"
        string_val: "input/training/n7/n7128.jpg"
        string_val: "input/training/n7/n7113.jpg"
        string_val: "input/training/n7/n7038.jpg"
        string_val: "input/training/n7/n7048.jpg"
        string_val: "input/training/n7/n7148.jpg"
        string_val: "input/training/n7/n7127.jpg"
        string_val: "input/training/n7/n7042.jpg"
        string_val: "input/training/n7/n7055.jpg"
        string_val: "input/training/n7/n7047.jpg"
        string_val: "input/training/n7/n7121.jpg"
        string_val: "input/training/n7/n7166.jpg"
        string_val: "input/training/n7/n7111.jpg"
        string_val: "input/training/n7/n7053.jpg"
        string_val: "input/training/n7/n7137.jpg"
        string_val: "input/training/n7/n7138.jpg"
        string_val: "input/training/n7/n7114.jpg"
        string_val: "input/training/n7/n7132.jpg"
        string_val: "input/training/n7/n7167.jpg"
        string_val: "input/training/n7/n7165.jpg"
        string_val: "input/training/n7/n7154.jpg"
        string_val: "input/training/n7/n7133.jpg"
        string_val: "input/training/n7/n7069.jpg"
        string_val: "input/training/n7/n7051.jpg"
        string_val: "input/training/n7/n7162.jpg"
        string_val: "input/training/n7/n7131.jpg"
        string_val: "input/training/n7/n7019.jpg"
        string_val: "input/training/n7/n7141.jpg"
        string_val: "input/training/n7/n7056.jpg"
        string_val: "input/training/n7/n7062.jpg"
        string_val: "input/training/n7/n7035.jpg"
        string_val: "input/training/n7/n7159.jpg"
        string_val: "input/training/n7/n7151.jpg"
        string_val: "input/training/n7/n702.jpg"
        string_val: "input/training/n7/n7064.jpg"
        string_val: "input/training/n7/n7169.jpg"
        string_val: "input/training/n7/n7020.jpg"
        string_val: "input/training/n7/n7160.jpg"
        string_val: "input/training/n7/n7145.jpg"
        string_val: "input/training/n7/n7023.jpg"
        string_val: "input/training/n7/n7034.jpg"
        string_val: "input/training/n7/n7124.jpg"
        string_val: "input/training/n7/n7155.jpg"
        string_val: "input/training/n7/n7153.jpg"
        string_val: "input/training/n7/n7146.jpg"
        string_val: "input/training/n7/n7068.jpg"
